package S1_CW;

public class Main {

    /*
     * Р РµР°Р»РёР·СѓР№С‚Рµ РјРµС‚РѕРґ, РїСЂРёРЅРёРјР°СЋС‰РёР№ РІ РєР°С‡РµСЃС‚РІРµ
     * Р°СЂРіСѓРјРµРЅС‚Р° С†РµР»РѕС‡РёСЃР»РµРЅРЅС‹Р№ РјР°СЃСЃРёРІ.
     * Р•СЃР»Рё РґР»РёРЅР° РјР°СЃСЃРёРІР° РјРµРЅСЊС€Рµ РЅРµРєРѕС‚РѕСЂРѕРіРѕ
     * Р·Р°РґР°РЅРЅРѕРіРѕ РјРёРЅРёРјСѓРјР°, РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ -1,
     * РІ РєР°С‡РµСЃС‚РІРµ РєРѕРґР° РѕС€РёР±РєРё, РёРЅР°С‡Рµ - РґР»РёРЅСѓ
     * РјР°СЃСЃРёРІР°.
     */
    public static void main(String[] args) {
        int[] arr = new int[] { 1, 2, 3 };
        int res = test(arr);
        if (res == -1) {
            System.out.println("Р”Р»РёРЅР° РјР°СЃСЃРёРІР° РјРµРЅСЊС€Рµ РЅРµРѕР±С…РѕРґРёРјРѕРіРѕ РјРёРЅРёРјСѓРјР°");
        } else {
            System.out.println("Р”Р»РёРЅР° РјР°СЃСЃРёРІР° СЂР°РІРЅР°: " + res);
        }
    }

    static int test(int[] arr) {
        int minSize = 4;
        if (arr.length < minSize) {
            return -1;
        }
        return arr.length;
    }
}
